app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC
---
  def index
    @produtos = Produto.all.order(:nome)

INSERT INTO "produtos" ("nome", "embalagem", "atacadao", "walmart", "assai", "created_at", "updated_at", "foto") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["nome", "café"], ["embalagem", 500], ["atacadao", 2], ["walmart", 3], ["assai", 3], ["created_at", "2017-10-30 12:13:10.735925"], ["updated_at", "2017-10-30 12:13:10.735925"], ["foto", ""]]
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

UPDATE "produtos" SET "foto" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["foto", "#<ActionDispatch::Http::UploadedFile:0x007f71a5312ef0>"], ["updated_at", "2017-11-01 17:20:20.145170"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @produto.update(produto_params)